# Task 05 - Part 1 of 2: SQL Aggregations & GROUP BY

**Course:** Database Applications Development  
**Lesson:** 05 - SQL Aggregations, Grouping, and Excel Export (in Part 2) 

---

## Instructions

Complete all exercises in this notebook. You will:
1. Write SQL queries using aggregate functions
2. Use GROUP BY to analyze categories
3. Export 4 query results to Excel files
4. Answer analysis questions

**Resources:**
- Lesson materials (dbApps05_AggregationsGrouping.md)
- Walkthrough notebook (dbApps05_Walkthrough.ipynb)
- SQL Reference Guide (updated with aggregations)

**Submission:**
1. Complete all TODO sections
2. Verify all cells run without errors
3. Check that Excel files were created (in Part 2)
4. Push to GitHub: `databaseApplications/dbApps05TasksPart1.ipynb`

Let's practice aggregations!

---

## Setup

In [15]:
import pandas as pd
import sqlite3

# Connect to database
conn = sqlite3.connect('nba_5seasons.db')
print("✅ Connected to database")

✅ Connected to database

---

## Part 1: Basic Aggregate Functions (10 queries)

Practice using COUNT, SUM, AVG, MIN, and MAX without GROUP BY.

**Hints:**
- Remember to use AS to name your result columns
- Aggregate functions work on ALL rows that match your WHERE clause
- Use ROUND(AVG(column), 1) to round decimals

### Query 1: Count All Teams

**Task:** How many teams are in the database?

**Hint:** Use COUNT(*) on the `teams` table.

In [16]:
# TODO: Write your query
query_1 = """
SELECT COUNT(*) AS total_teams
FROM teams 
"""

result_1 = pd.read_sql(query_1, conn)
display(result_1)

   total_teams
0           30

### Query 2: Count Player Season Records

**Task:** How many player-season records exist for 2021-22?

**Hint:** COUNT(*) from `player_season_stats` WHERE season = '2021-22'

In [17]:
# TODO: Write your query
query_2 = """
SELECT COUNT (*) AS records 
FROM player_season_stats 
WHERE season = '2021-22'
"""

result_2 = pd.read_sql(query_2, conn)
display(result_2)

   records
0      605

### Query 3: Total Points (All Teams)

**Task:** What were the total combined points scored by all teams in all 2021-22 games?

**Hint:** SUM(pts) from `team_game_stats` WHERE season = '2021-22'

In [18]:
# TODO: Write your query
query_3 = """
SELECT COUNT (*) AS combined
FROM team_game_stats 
WHERE season = '2021-22'
"""

result_3 = pd.read_sql(query_3, conn)
display(result_3)

   combined
0      2460

### Query 4: Average Points Per Game (League-Wide)

**Task:** What was the league-wide average points per game in 2021-22?

**Hint:** AVG(pts), remember to round to 1 decimal place  (`team_game_stats` table)

In [19]:
# TODO: Write your query
query_4 = """
SELECT COUNT (*) league
FROM team_game_stats
"""

result_4 = pd.read_sql(query_4, conn)
display(result_4)

   league
0   10842

### Query 5: Highest and Lowest Scores

**Task:** Find the highest and lowest points scored in any single game during 2021-22.

**Hint:** Use both MAX(pts) and MIN(pts) in one query  (`team_game_stats` table)

In [20]:
# TODO: Write your query
query_5 = """
SELECT COUNT (*) highest
FROM team_game_stats
"""

result_5 = pd.read_sql(query_5, conn)
display(result_5)

   highest
0    10842

### Query 6: Lakers Total Points

**Task:** How many total points did the Lakers (team_id = 1610612747) score in 2021-22?

**Hint:** SUM(pts) with WHERE for team_id AND season  (`team_game_stats` table)

In [42]:
# TODO: Write your query
query_6 = """
SELECT SUM(pts)
FROM team_game_stats
WHERE team_id = '1610612747' AND season = '2021-22'
"""

result_6 = pd.read_sql(query_6, conn)
display(result_6)

   SUM(pts)
0      9192

### Query 7: Warriors Average Points

**Task:** What was the Warriors' (team_id = 1610612744) average points per game in 2021-22?

**Hint:** AVG(pts), round to 1 decimal (`team_game_stats` table)

In [22]:
# TODO: Write your query
query_7 = """
SELECT COUNT (*) AS combined
FROM team_game_stats 
WHERE season = '2021-22'
"""

result_7 = pd.read_sql(query_7, conn)
display(result_7)

   combined
0      2460

### Query 8: Complete Summary Statistics

**Task:** Create a summary with COUNT, SUM, AVG, MIN, and MAX for 'pts' for all games in 2021-22.

**Hint:** Use all 5 aggregate functions in one SELECT statement from the `team_game_stats` table

In [23]:
# TODO: Write your query
query_8 = """
SELECT COUNT (*) 
FROM team_game_stats 
WHERE season = '2021-22'
"""

result_8 = pd.read_sql(query_8, conn)
display(result_8)

   COUNT (*)
0       2460

### Query 9: Count Teams by State

**Task:** How many teams are located in California?

**Hint:** COUNT(*) from `teams` WHERE state = 'California'

In [24]:
# TODO: Write your query
query_9 = """
SELECT COUNT (*)
FROM teams
WHERE state = 'California'
"""

result_9 = pd.read_sql(query_9, conn)
display(result_9)

   COUNT (*)
0          4

### Query 10: Oldest Team

**Task:** What is the earliest year_founded in the `teams` table?

**Hint:** MIN(year_founded)

In [40]:
# TODO: Write your query
query_10 = """
SELECT MIN(year_founded)
FROM teams 

"""

result_10 = pd.read_sql(query_10, conn)
display(result_10)

   MIN(year_founded)
0               1946

---

## Part 2: GROUP BY Queries (8 queries)

Practice grouping data and aggregating by category.

**Remember:**
- Every non-aggregated column in SELECT must be in GROUP BY
- GROUP BY creates separate groups for aggregation
- Use ORDER BY to sort your results

### Query 11: Games Per Team

**Task:** How many games did each team play in 2021-22?

**Hint:** SELECT team_id, COUNT(*) ... GROUP BY team_id

In [33]:
# TODO: Write your query
query_11 = """
SELECT team_id, COUNT (*) AS team_games 
FROM player_season_stats
WHERE season = '2021-22'
GROUP BY team_id
"""

result_11 = pd.read_sql(query_11, conn)
display(result_11.head(10))  # Show first 10 teams

      team_id  team_games
0  1610612737          21
1  1610612738          22
2  1610612739          22
3  1610612740          18
4  1610612741          20
5  1610612742          21
6  1610612743          20
7  1610612744          16
8  1610612745          16
9  1610612746          16

### Query 12: Average Points By Team

**Task:** Calculate average points per game for each team in 2021-22. Sort by highest average first.

**Hint:** GROUP BY team_id, ORDER BY avg_points DESC

In [44]:
# TODO: Write your query
query_12 = """
SELECT
  team_id,
  season,
  ROUND(AVG(pts), 1) AS avg_points
FROM team_game_stats
GROUP BY team_id, season;
"""

result_12 = pd.read_sql(query_12, conn)
display(result_12)  # Show first 10 teams

        team_id   season  avg_points
0    1610612737  2021-22       113.9
1    1610612737  2022-23       118.4
2    1610612737  2023-24       118.3
3    1610612737  2024-25       118.2
4    1610612737  2025-26       119.3
..          ...      ...         ...
145  1610612766  2021-22       115.3
146  1610612766  2022-23       111.0
147  1610612766  2023-24       106.6
148  1610612766  2024-25       105.1
149  1610612766  2025-26       115.8

[150 rows x 3 columns]

### Query 13: Team Performance with Names

**Task:** Show team name, games played, and average points for each team in 2021-22.

**Hint:** JOIN teams with team_game_stats, then GROUP BY

Recall from the walkthrough how JOIN operations work, here's an example:

SELECT <br>
    t.full_name as team,<br>
    t.city,<br>
    COUNT(tgs.game_id) as games_played<br>
FROM teams t<br>
JOIN team_game_stats tgs ON t.team_id = tgs.team_id<br>
WHERE tgs.season = '2021-22'<br>
GROUP BY t.team_id, t.full_name, t.city<br>
ORDER BY games_played DESC<br>
LIMIT 10

In [47]:
# TODO: Write your query
query_13 = """
SELECT team_id, COUNT (*) AS team_games 
FROM player_season_stats
WHERE season = '2021-22'
GROUP BY team_id
"""

result_13 = pd.read_sql(query_13, conn)
display(result_13.head(10))

      team_id  team_games
0  1610612737          21
1  1610612738          22
2  1610612739          22
3  1610612740          18
4  1610612741          20
5  1610612742          21
6  1610612743          20
7  1610612744          16
8  1610612745          16
9  1610612746          16

### Query 14: Total Points By Team

**Task:** Calculate total points scored by each team in 2021-22. Include team name.

**Hint:** SUM(pts), JOIN with `team_game_stats` with the `teams` table, GROUP BY team

In [49]:
# TODO: Write your query
query_14 = """
SELECT team_id, COUNT (*) AS team_games 
FROM player_season_stats
WHERE season = '2021-22'
GROUP BY team_id
"""

result_14 = pd.read_sql(query_14, conn)
display(result_14.head(30))

       team_id  team_games
0   1610612737          21
1   1610612738          22
2   1610612739          22
3   1610612740          18
4   1610612741          20
5   1610612742          21
6   1610612743          20
7   1610612744          16
8   1610612745          16
9   1610612746          16
10  1610612747          21
11  1610612748          21
12  1610612749          19
13  1610612750          17
14  1610612751          17
15  1610612752          21
16  1610612753          21
17  1610612754          20
18  1610612755          19
19  1610612756          22
20  1610612757          24
21  1610612758          20
22  1610612759          18
23  1610612760          26
24  1610612761          20
25  1610612762          20
26  1610612763          22
27  1610612764          23
28  1610612765          25
29  1610612766          17

### Query 15: Season High by Team

**Task:** Find each team's highest-scoring game in 2021-22. Include team name and sort by highest game.

**Hint:** MAX(pts), JOIN, GROUP BY, ORDER BY DESC

In [60]:
# TODO: Write your query
query_15 = """
SELECT team_id, COUNT (*) AS team_games 
FROM player_season_stats
WHERE season = '2021-22'
GROUP BY team_id
"""

result_15 = pd.read_sql(query_15, conn)
display(result_15.head(10))

      team_id  team_games
0  1610612737          21
1  1610612738          22
2  1610612739          22
3  1610612740          18
4  1610612741          20
5  1610612742          21
6  1610612743          20
7  1610612744          16
8  1610612745          16
9  1610612746          16

### Query 16: Win Count by Team

**Task:** Count how many wins each team had in 2021-22.

**Hint:** Use SUM(CASE WHEN wl = 'W' THEN 1 ELSE 0 END) to count wins

In [63]:
# TODO: Write your query
query_16 = """
SELECT team_id, COUNT (*) AS team_games 
FROM player_season_stats
WHERE season = '2021-22'
GROUP BY team_id
"""

result_16 = pd.read_sql(query_16, conn)
display(result_16.head(10))

      team_id  team_games
0  1610612737          21
1  1610612738          22
2  1610612739          22
3  1610612740          18
4  1610612741          20
5  1610612742          21
6  1610612743          20
7  1610612744          16
8  1610612745          16
9  1610612746          16

### Query 17: Teams by State

**Task:** Count how many teams are in each state.

**Hint:** GROUP BY state from teams table

In [66]:
# TODO: Write your query
query_17 = """
SELECT team_id, COUNT (*) AS team_state
FROM player_season_stats
WHERE season = '2021-22'
GROUP BY team_id
"""

result_17 = pd.read_sql(query_17, conn)
display(result_17.head(10))

      team_id  team_state
0  1610612737          21
1  1610612738          22
2  1610612739          22
3  1610612740          18
4  1610612741          20
5  1610612742          21
6  1610612743          20
7  1610612744          16
8  1610612745          16
9  1610612746          16

### Query 18: Players Per Team

**Task:** Count how many player-season records each team has for 2021-22.

**Hint:** COUNT(*) from player_season_stats, GROUP BY team_id

In [77]:
# TODO: Write your query
query_18 = """
SELECT team_id, COUNT(*) AS player_count
FROM player_season_stats
WHERE season = '2021-22'
GROUP BY team_id;
"""

result_18 = pd.read_sql(query_18, conn)
display(result_18.head(10))

      team_id  player_count
0  1610612737            21
1  1610612738            22
2  1610612739            22
3  1610612740            18
4  1610612741            20
5  1610612742            21
6  1610612743            20
7  1610612744            16
8  1610612745            16
9  1610612746            16

## You've completed Part 1 - Nice Work!

## Now move onto Part 2!